#!/usr/bin/ruby --
#化学実験6 by t.yamada
#恐れ入りますが、プログラム部分を書き写すことは禁止させていただきます(式自体と文章と結果はOKです)。

#なお、このファイルには本日の全てのデータが入っております。

#ヒント:http://www.geocities.jp/ut_s1_21/No16.html

#Math.log(y)は自然対数を求める関数なので、2.303*Math.log10(y)と同じ意味です。

#x切片とy切片からkを導出
def k(x,y)
	return Math.log(y)/x.to_f
end
#45C: k(10.5,70.6)=0.4054
#39C: k(10.1,70.6)=0.4215

#ΔxとΔyからeaを導出
def ea(x,y1,y2)
	include Math
	return 8.314*(log(y2)-log(y1))/x.to_f
end
#直線になる仮定の元で
#ミョウバン:ea(0.00019,0.0415,0.341)=92162
#ヨウ化カリウム:ea(0.00019,0.144,0.539)=57756

#45C
def f45
	v0=70.6
	a=[0,7.8,18.6,28.0,35.8,42.2,46.8,52.0,54.8,56.6,58.8,62.2,63.6,65.4,66.4,67.0,67.8,68.4,69.0,69.4,69.8]
	a.length.times{|i|
		a[i]=v0-a[i]
	}
	return a
end

#39C
def f39
	v0=70.6
	a=[0,19.0,25.8,33.0,39.2,44.6,49.0,52.6,56.0,59.6,61.0,62.8,65.0,66.2,67.2,68.0,69.0,69.4,69.4,70.0,70.0,70.6,70.6,70.6,70.6,70.6,70.6,70.6,70.6,70.6,70.6]
	a.length.times{|i|
		a[i]=v0-a[i]
	}
	return a
end

#1/T
def t
	return 1.0/(273+27), 1.0/(273+33), 1.0/(273+39), 1.0/(273+45)
end
# => [0.00333, 0.00327, 0.00321, 0.00314]

#明礬
def myo
	a=[
		[0.04193, 0.041],
		[0.1067,  0.11],
		[0.1529,  0.248],
		[0.4013, 0.319, 0.3747, 0.319, 0.3155, 0.316]
	]
	a.length.times{|i|
		a[i]=a[i].average
	}
	return a
end
# => [0.0415, 0.108, 0.200, 0.341]

#ヨウ化カリウム(データ訂正済。申し訳ありませんでした)
def ki
	a=[
		[0.13777, 0.150],
		[0.2431,  0.264],
		[0.4214,  0.4215],
		[0.5713, 0.546, 0.5658, 0.5984, 0.5481, 0.4054]
	]
	a.length.times{|i|
		a[i]=a[i].average
	}
	return a
end
# => [0.144, 0.254, 0.421, 0.539]

def q6_2 #積分定数は近いと仮定する
	return 33/57756.0 * 92162
end
# => 52.66 -> 53C
